-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2019 年 05 月 11 日 14:49
-- 伺服器版本： 10.1.38-MariaDB
-- PHP 版本： 7.3.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `homework`
--

-- --------------------------------------------------------

--
-- 資料表結構 `customer`
--

CREATE TABLE `customer` (
  `id` int(10) UNSIGNED NOT NULL,
  `客戶寶號` varchar(14) DEFAULT NULL,
  `客戶代號` varchar(5) DEFAULT NULL,
  `縣市` varchar(3) DEFAULT NULL,
  `地址` varchar(18) DEFAULT NULL,
  `郵遞區號` int(3) DEFAULT NULL,
  `聯絡人` varchar(3) DEFAULT NULL,
  `職稱` varchar(4) DEFAULT NULL,
  `電話` varchar(10) DEFAULT NULL,
  `行業別` varchar(2) DEFAULT NULL,
  `統一編號` int(8) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `customer`
--

INSERT INTO `customer` (`id`, `客戶寶號`, `客戶代號`, `縣市`, `地址`, `郵遞區號`, `聯絡人`, `職稱`, `電話`, `行業別`, `統一編號`) VALUES
(1, '洽興金屬工業股份有限公司', 'A0001', '台中市', '西屯區工業區12路5號', 407, '陳勳森', '採購專員', '04-7081881', '機械', 86281373),
(2, '新益機械工廠股份有限公司', 'A0002', '台北市', '北投區承德路7段371-1號', 100, '謝裕民', '行政專員', '02-7752450', '機械', 4675569),
(3, '天源義記機械股份有限公司', 'A0003', '台北市', '松山區敦化北路122號3樓', 105, '翁崇銘', '工程師', '02-9015105', '機械', 22039731),
(4, '家鄉事業股份有限公司', 'A0004', '台北市', '復興北路57號5樓', 108, '郭淑玲', '行政專員', '02-1879991', '食品', 85800192),
(5, '四維企業(股)公司', 'A0005', '台南縣', '歸仁鄉南興村中山路851號', 720, '廖述宏', '工程師', '06-8792123', '建築', 12231596),
(6, '永輝興電機工業股份有限公司', 'A0006', '台南縣', '麻豆鎮小埤里苓子林8-12號', 710, '黃清吉', '總務主任', '06-4588455', '電機', 4735004),
(7, '溪泉電器工廠股份有限公司', 'A0007', '台中市', '西屯區台中工業區工業五路3號', 407, '林慶文', '工程師', '04-7613571', '電子', 7406808),
(8, '善品精機股份有限公司', 'A0008', '台中縣', '烏日鄉中山路三段6號', 414, '張君暉', '工程師', '04-2552171', '機械', 11222009),
(9, '佳樂電子股份有限公司', 'A0009', '台北市', '大安區復興南路一段390號5樓之3', 106, '蔣清池', '總務主任', '02-2301212', '電子', 61781463),
(10, '科隆實業股份有限公司', 'A0010', '台北市', '大安區敦化南路一段223號8樓', 106, '劉瑞復', '工程師', '02-7721320', '貿易', 97513218),
(11, '永光壓鑄企業公司', 'A0011', '台北市', '中山北路三段22號', 104, '梁文雄', '工程師', '02-2514474', '機械', 52003703),
(12, '正五傑機械股份有限公司', 'A0012', '台北市', '中山區松江路293號805室', 111, '林金源', '採購專員', '02-9991061', '機械', 3807628),
(13, '集上科技股份有限公司', 'A0013', '台北市', '中山區南京東路3段65號2樓', 104, '陳幼獅', '行政專員', '02-7174500', '資訊', 79854797),
(14, '強安鋼架工程股份有限公司', 'A0014', '台北市', '中正區博愛路154號6-7樓', 104, '林添財', '主任', '02-9179261', '機械', 11081681),
(15, '菱生精密工業股份有限公司', 'A0015', '台北市', '中正區懷寧街43號6樓', 100, '張國萬', '採購專員', '02-6668541', '電子', 11099303),
(16, '昆信機械工業股份有限公司', 'A0016', '台北市', '忠孝東路四段285號13樓', 103, '陳世棟', '採購專員', '02-7195800', '機械', 22956788),
(17, '麥柏股份有限公司', 'A0017', '台北市', '松山區南京東路三段248號14樓', 110, '楊喜棠', '工程師', '02-1184988', '貿易', 51868406),
(18, '九和汽車股份有限公司', 'A0018', '台北市', '信義路五段2號14樓', 104, '李青潭', '工程師', '02-2595286', '機械', 3722109),
(19, '遠東氣體工業股份有限公司', 'A0019', '台北市', '許昌街四二號九樓', 104, '李進興', '總務主任', '02-4688516', '化學', 52004800),
(20, '諾貝爾生物有限公司', 'A0020', '台北市', '塔城街66號3樓', 106, '蘇益慶', '工程師', '02-9879103', '化學', 86172733),
(21, '有萬貿易股份有限公司', 'A0021', '台北市', '土城市大暖路71號', 114, '張子信', '工程師', '02-1524755', '貿易', 5135739),
(22, '真正精機股份有限公司', 'A0022', '台北縣', '土城市自強街29號', 241, '黃俊勝', '行政專員', '02-5569536', '機械', 61602905),
(23, '東興振業股份有限公司', 'A0023', '台北縣', '汐止鎮大同路3段275號', 236, '徐旭明', '主任', '02-4247674', '建築', 73251209),
(24, '漢寶農畜產企業股份有限公司', 'A0024', '台北縣', '板橋市民生路一段28號', 235, '林勝豐', '採購專員', '02-8795884', '食品', 7881361),
(25, '大喬機械公司', 'A0025', '台北縣', '新店市寶興路45巷5號3樓', 251, '呂擇賞', '工程師', '02-4998556', '機械', 22099630),
(26, '達亞汽車股份有限公司', 'A0026', '台北縣', '仁德鄉保安村開發四路6號', 238, '鄭榮勳', '採購專員', '02-4489598', '機械', 72065240),
(27, '台灣航空電子股份有限公司', 'A0027', '桃園縣', '桃園市大林里大仁路50號', 334, '周正義', '主任', '03-4856525', '電子', 4697347),
(28, '鐶琪塑膠股份有限公司', 'A0028', '桃園縣', '楊梅鎮大同里行善路80號', 337, '陳登榜', '工程師', '03-1385562', '化學', 60330130),
(29, '亞智股份有限公司', 'A0029', '桃園縣', '龜山鄉善村文德路25號', 324, '黃正弘', '行政專員', '03-4855525', '建築', 3932533),
(30, '九華營造工程股份有限公司', 'A0030', '桃園縣', '蘆竹鄉南崁路二段201巷7號', 330, '唐樂川', '總務主任', '03-2659569', '建築', 22099934),
(31, '台灣保谷光學股份有限公司', 'A0031', '桃園縣', '小港區中林路26號', 325, '林長芳', '工程師', '03-2365566', '電子', 86159485),
(32, '豐興鋼鐵(股)公司', 'A0032', '桃園縣', '五福三路21號6樓', 338, '吳政翔', '總務主任', '03-4554521', '機械', 21222725),
(33, '中友開發建設股份有限公司', 'A0033', '高雄市', '鼓山區明倫路514巷19號', 813, '劉宗齊', '採購專員', '07-2665563', '建築', 86379208),
(34, '長生營造股份有限公司', 'A0034', '高雄市', '大社工業區興工路1-3號', 806, '楊菊生', '工程師', '07-5645655', '建築', 75370905),
(35, '百容電子股份有限公司', 'A0035', '新竹市', '科學工業園區園區二路47號105室', 300, '賴朝宗', '採購', '035-189566', '電子', 84308030),
(36, '欣中天然氣股份有限公司', 'A0036', '新竹市', '竹東鎮中興路四段14號', 300, '胡明宗', '採購助理', '035-789542', '化學', 3703601),
(37, '比力機械工業股份有限公司', 'A0037', '新竹市', '水上鄉回歸村北回60號', 300, '王振芳', '總務助理', '035-585985', '機械', 23120951),
(38, '詮讚興業公司', 'A0038', '新竹縣', '秀水鄉埔崙村三越街82號', 302, '林清富', '工程師', '035-584425', '其他', 22018285),
(39, '台灣釜屋電機股份有限公司', 'A0039', '台中縣', '烏日鄉中山路一段和平巷150弄27號', 414, '顏仲仁', '總務主任', '04-8342662', '機械', 23418669),
(40, '國光血清疫苗製造股份有限公司', 'A0040', '台北市', '士林區社中街76號', 111, '徐賢德', '工程師', '02-7351127', '化學', 11085292),
(41, '台灣製罐工業股份有限公司', 'A0041', '台北市', '大安區忠孝東路4段285號6樓', 106, '許金良', '採購專員', '02-5316125', '食品', 3767301),
(42, '雅企科技(股)', 'A0042', '台北市', '中山區南京東路二段95號11樓', 104, '徐惠秋', '總務主任', '02-7751286', '資訊', 6606103),
(43, '國豐電線工廠股份有限公司', 'A0043', '台北市', '敦化南路522號2樓', 106, '巫嘉昌', '工程師', '02-1949849', '電機', 52004800),
(44, '金興鋼鐵股份有限公司', 'A0044', '台北市', '華陰街119號', 105, '黃永松', '總務主任', '02-4789198', '機械', 77514419),
(45, '原帥電機股份有限公司', 'A0045', '台北縣', '新店市寶橋路229號', 220, '李春淵', '採購專員', '02-8499256', '電機', 23826519),
(46, '新寶纖維股份有限公司', 'A0046', '台北縣', '樹林鎮東興街1號', 231, '林棟材', '工程師', '02-9985554', '化學', 12223723),
(47, '太平洋汽門工業股份有限公司', 'A0047', '台南縣', '中壢市新生路二段334號', 721, '呂碧如', '工程師', '06-4882554', '機械', 41695406),
(48, '喬福機械工業股份有限公司', 'A0048', '台南縣', '八德市大湳里和平路1127號', 711, '張朝深', '總務主任', '06-8884551', '機械', 3329507),
(49, '楓原設計公司', 'A0049', '桃園縣', '大園鄉橫峰村1號', 320, '陳世昌', '採購專員', '03-4884525', '其他', 7284214),
(50, '日南紡織股份有限公司', 'A0050', '桃園縣', '平鎮市建安村太平東路7號', 330, '陳標山', '行政專員', '03-5568425', '紡織', 37199708),
(51, '台灣勝家實業股份有限公司', 'A0051', '桃園縣', '楊梅鎮秀才路520號', 337, '陳智雄', '工程師', '03-4825826', '貿易', 5630750),
(52, '周家合板股份有限公司', 'A0052', '桃園縣', '龜山鄉樂善村文德路25號', 330, '陳肇源', '採購專員', '03-4851551', '建築', 76940003),
(53, '英業達股份有限公司', 'A0053', '新竹市', '科學工業園區園區二路40號1樓', 300, '鄭景昌', '行政專員', '035-645858', '電子', 12388674),
(54, '羽田機械股份有限公司', 'A0054', '新竹縣', '和美鎮彰美路二段106號', 310, '張永茂', '工程師', '035-851453', '機械', 85614991),
(55, '中衛聯合開發公司', 'A0055', '台中市', '南屯區南屯路三段86號', 408, '蔡淑慧', '工程師', '04-5062442', '建築', 75370905),
(56, '台中精機廠股份有限公司', 'A0056', '台北市', '大安區敦化南路1段331號6樓', 106, '杜鴻國', '採購專員', '02-3592139', '機械', 38011301),
(57, '東陽實業(股)公司', 'A0057', '台北市', '中山區松江路301號9樓', 111, '葉育恩', '工程師', '02-4951111', '貿易', 12486393),
(58, '金泰成粉廠股份有限公司', 'A0058', '台北市', '中正區延平南路10號', 104, '林繼宗', '採購專員', '02-4648165', '食品', 22102494),
(59, '現代農牧股份有限公司', 'A0059', '台北市', '南港區東新街34巷10號3樓', 105, '秦嘉鴻', '採購專員', '02-7899552', '食品', 74231126),
(60, '惠亞工程股份有限公司', 'A0060', '台北市', '三重市重新路五段609巷16號6樓', 106, '高文彬', '總務主任', '02-6548854', '建築', 6673382);

-- --------------------------------------------------------

--
-- 資料表結構 `dept`
--

CREATE TABLE `dept` (
  `id` int(10) UNSIGNED NOT NULL,
  `部門名稱` varchar(4) DEFAULT NULL,
  `部門代號` varchar(3) DEFAULT NULL,
  `主管姓名` varchar(3) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `dept`
--

INSERT INTO `dept` (`id`, `部門名稱`, `部門代號`, `主管姓名`) VALUES
(1, '董事長室', 'A01', '林政賢'),
(2, '總經理室', 'B01', '何茂宗'),
(3, '研發一課', 'C01', '徐煥坤'),
(4, '研發二課', 'C02', '江正維'),
(5, '研發三課', 'C03', '易君揚'),
(6, '業務一課', 'D01', '陳曉蘭'),
(7, '業務二課', 'D02', '陳雅賢'),
(8, '業務三課', 'D03', '朱金倉'),
(9, '業務四課', 'D04', '林鵬翔'),
(10, '採購部', 'E01', '黃大倫'),
(11, '維修部', 'F01', '劉柏村'),
(12, '資訊部', 'G01', '林朝財'),
(13, '企劃部', 'H01', '程光民'),
(14, '人事部', 'I01', '楊習仁'),
(15, '行政部', 'J01', '許進發'),
(16, '會計部', 'K01', '胡富傑'),
(17, '圖書室', 'L01', '洪惠芬');

-- --------------------------------------------------------

--
-- 資料表結構 `employee`
--

CREATE TABLE `employee` (
  `id` int(10) UNSIGNED NOT NULL,
  `姓名` varchar(3) DEFAULT NULL,
  `現任職稱` varchar(5) DEFAULT NULL,
  `部門代號` varchar(3) DEFAULT NULL,
  `縣市` varchar(3) DEFAULT NULL,
  `地址` varchar(18) DEFAULT NULL,
  `電話` varchar(16) DEFAULT NULL,
  `郵遞區號` int(3) DEFAULT NULL,
  `目前月薪資` int(6) DEFAULT NULL,
  `年假天數` int(2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `employee`
--

INSERT INTO `employee` (`id`, `姓名`, `現任職稱`, `部門代號`, `縣市`, `地址`, `電話`, `郵遞區號`, `目前月薪資`, `年假天數`) VALUES
(1, '方重圍', '顧問工程師', 'A01', '新竹市', '科學工業園區工業東四路7號2樓', '035-780050', 300, 185000, 7),
(2, '何茂宗', '總經理', 'B01', '台北市', '中山區松江路301號9樓', '02-5020238', 104, 154000, 14),
(3, '黃慧萍', '特別助理', 'B01', '台北縣', '新店市寶興路45巷5號3樓', '02-9179261', 231, 82000, 14),
(4, '林建興', '研發副總', 'B01', '屏東市', '中正路688巷46弄59號', '08-7379531', 900, 138000, 14),
(5, '蔡豪鈞', '業務副總', 'B01', '桃園縣', '楊梅鎮高榮里新榮路339號', '03-4905265', 326, 36000, 7),
(6, '林森和', '助理工程師', 'C01', '台北市', '民權東路3段37號12樓', '(02)515-0000', 104, 38000, 7),
(7, '黃志文', '研發副理', 'C01', '台北市', '光復南路422號2樓之1', '02-7043828', 106, 66200, 14),
(8, '張藍方', '研發經理', 'C01', '台北市', '松德路159號-1', '02-7593733', 110, 67400, 14),
(9, '徐煥坤', '資深工程師', 'C01', '台北縣', '土城市福安街75號', '02-2685871', 236, 36000, 14),
(10, '王德惠', '研發工程師', 'C01', '台北縣', '新店市寶中路123巷1號5樓', '02-9174400', 231, 37000, 7),
(11, '莊清媚', '研發工程師', 'C02', '台中市', '北區漢口路4段367號11樓', '04-2374989', 404, 33000, 14),
(12, '張景松', '副工程師', 'C02', '台中市', '西屯區台中工業區工業五路3號', '04-3592345', 407, 31500, 14),
(13, '李垂文', '研發副理', 'C02', '台中縣', '大里市仁化路261號', '(04)491-4141#254', 412, 34500, 7),
(14, '盧大為', '研發經理', 'C02', '台北市', '大同區承德路一段40號12樓', '02-5559211', 103, 33000, 14),
(15, '江正維', '研發工程師', 'C02', '台北市', '松山區南京東路5段5號2樓', '02-7649130', 105, 61000, 14),
(16, '鍾智慧', '研發工程師', 'C03', '台北市', '八德路二段260號9樓', '02-7752450', 104, 29500, 7),
(17, '方鎮深', '副工程師', 'C03', '台北市', '士林區社中街76號', '02-8118101', 111, 32000, 14),
(18, '楊銘哲', '研發副理', 'C03', '台北市', '萬華區漢口街2段60號', '02-3111116', 108, 27200, 14),
(19, '王演銓', '研發經理', 'C03', '桃園縣', '大園鄉北港村大工路31號', '03-3868956', 337, 38200, 14),
(20, '易君揚', '助理工程師', 'C03', '桃園縣', '楊梅鎮秀才路520號', '03-4753821', 326, 75200, 14),
(21, '鄭秀家', '研發工程師', 'C03', '高雄市', '五福三路21號6樓', '07-2135522', 801, 36500, 7),
(22, '王玉治', '業務副理', 'D01', '台中縣', '潭子鄉建國路3之2號', '04-5331112', 427, 34800, 14),
(23, '林鳳春', '業務專員', 'D01', '台北市', '中正區杭洲南路1段15-1號19樓', '02-3936566', 100, 59000, 14),
(24, '葉秀珠', '業務助理', 'D01', '台北市', '南港區成功路一段65號2&3樓', '02-7832854', 115, 24800, 7),
(25, '陳曉蘭', '業務經理', 'D01', '台南縣', '歸仁鄉南興村中山路851號', '06-2306611', 711, 29500, 7),
(26, '吳美成', '資深專員', 'D01', '彰化縣', '和美鎮彰美路二段106號', '04-7352182', 508, 34800, 7),
(27, '莊國雄', '業務副理', 'D02', '台中縣', '潭子鄉中山路三段493巷35號', '04-5343566', 427, 39200, 7),
(28, '向大鵬', '業務專員', 'D02', '台北市', '建國北路2段145號3樓', '02-5031111', 104, 23400, 7),
(29, '陳詔芳', '業務助理', 'D02', '高雄市', '新興區中正二路182號8-1樓', '07-2228856', 800, 27800, 7),
(30, '陳雅賢', '業務經理', 'D02', '新竹縣', '湖口鄉光復北路92號', '035-981491', 303, 54200, 14),
(31, '吳國信', '資深專員', 'D02', '彰化縣', '福興鄉萬豐村福工路12號', '04-7695161~4', 506, 37000, 7),
(32, '張志輝', '業務副理', 'D03', '台中縣', '大肚鄉沙田路二段132巷60號', '04-6991173', 432, 31500, 7),
(33, '林玉堂', '業務專員', 'D03', '台北市', '松江路124巷21號4樓', '02-5926597', 104, 25500, 7),
(34, '張世興', '業務助理', 'D03', '台北縣', '淡水鎮下圭柔山100-2號', '02-6228750', 251, 70000, 14),
(35, '朱金倉', '業務經理', 'D03', '高雄市', '三民區通化街120號', '07-3712111', 807, 38900, 14),
(36, '謝穎青', '資深專員', 'D03', '高雄縣', '仁武鄉仁心路311號', '07-3711696', 814, 24500, 7),
(37, '毛渝南', '業務副理', 'D04', '台北市', '大安區敦化南路2段218號', '02-3779968', 106, 76000, 7),
(38, '郭曜明', '業務專員', 'D04', '台北市', '中山區八德路四段111號', '02-7532121', 105, 26000, 7),
(39, '李進祿', '業務專員', 'D04', '台北市', '松山區復興北路369號3樓', '02-7150669', 105, 25000, 7),
(40, '陳惠娟', '業務助理', 'D04', '高雄市', '三民區灣興街96之1號', '07-3853358', 807, 23000, 14),
(41, '林鵬翔', '業務經理', 'D04', '彰化縣', '和美鎮鎮平里彰草路二段697號', '04-7525121', 508, 36000, 7),
(42, '黃大倫', '採購經理', 'E01', '台中縣', '大肚鄉沙田路二段310巷2號', '04-6991191', 432, 27000, 14),
(43, '黃振清', '採購副理', 'E01', '台北市', '大同區重慶北路三段137巷25號2樓', '02-5976225', 103, 34500, 14),
(44, '林國和', '採購專員', 'E01', '台北市', '民生西路292號10樓', '02-5559676', 103, 62000, 14),
(45, '黃秋好', '採購專員', 'E01', '台北市', '新明路124號', '02-7912161', 114, 23400, 7),
(46, '陳弘昌', '採購助理', 'E01', '台南縣', '永康鄉中正北路711號', '06-2531221', 710, 22000, 7),
(47, '張琪', '採購助理', 'E01', '桃園縣', '大園鄉橫峰村1號', '03-3811811', 337, 22500, 7),
(48, '許鴻章', '維修經理', 'E01', '彰化縣', '秀水鄉埔崙村三越街82號', '04-7692511', 504, 25500, 7),
(49, '連邦俊', '維修助理', 'F01', '台北市', '大安區仁愛路三段108號7樓', '02-7042162', 106, 28900, 14),
(50, '張治', '維修工程師', 'F01', '台北市', '大安區復興南路一段390號5樓之3', '02-7081881', 106, 37800, 14),
(51, '吳寶珠', '維修工程師', 'F01', '台北市', '中山區長安東路2段173號7樓', '02-7720267', 104, 32500, 14),
(52, '洪毓祥', '維修工程師', 'F01', '台北市', '中正區忠孝東路2段123號B1', '02-3971881', 100, 40000, 14),
(53, '丁組長', '助理工程師', 'F01', '台北市', '松山區南京東路5段46號7樓', '02-7613571', 105, 28500, 7),
(54, '李秋煌', '助理工程師', 'F01', '台北市', '許昌街四二號九樓', '02-6584251', 100, 25600, 7),
(55, '何信穎', '副工程師', 'F01', '台北縣', '土城市工業區中山路59號', '02-2683366', 236, 37900, 7),
(56, '陳福金', '副工程師', 'F01', '台北縣', '樹林鎮三俊街273號', '02-6882387', 223, 28000, 7),
(57, '林靜秋', '維修副理', 'F01', '桃園縣', '龍潭鄉九龍村中興路九龍段3巷13號', '03-4792988', 325, 59500, 14),
(58, '劉柏村', '維修經理', 'F01', '高雄市', '鼓山區明倫路514巷19號', '07-5836967', 804, 31000, 7),
(59, '季正杰', '資深工程師', 'F01', '嘉義市', '中正路690號', '05-3714666', 600, 61000, 7),
(60, '顧舜生', '系統工程師', 'G01', '台中市', '台中工業區37路46號', '04-3594510', 400, 33300, 7),
(61, '祝閔豪', '系統工程師', 'G01', '台北市', '松山區民生東路4段54號9樓901室', '02-7152266', 105, 31500, 14),
(62, '鄭力中', '硬體工程師', 'G01', '台北市', '長春路328號5樓之2', '02-7198303', 104, 32500, 7),
(63, '范揚耀', '程式設計師', 'G01', '台北市', '新生南路一段121號4樓', '02-2990212', 106, 31500, 7),
(64, '高鴻烈', '程式設計師', 'G01', '台南縣', '永康市王行路68巷263號', '06-2017777', 710, 31500, 7),
(65, '林朝財', '資訊經理', 'G01', '高雄市', '三民區民族一路491號', '07-3410301', 807, 72000, 14),
(66, '陳美玉', '網路工程師', 'G01', '新竹縣', '湖口鄉新竹工業區光復南路15號', '035-983683', 303, 34500, 7),
(67, '吳淑芬', '市場分析師', 'H01', '台北市', '士林區中正路115號', '02-8822342', 111, 31500, 7),
(68, '林俊成', '企劃專員', 'H01', '台北市', '大同區貴德街36巷5號', '02-5555601', 103, 32500, 7),
(69, '簡清皛', '企劃專員', 'H01', '台北市', '中山北路六段75號', '02-8342662', 111, 31000, 7),
(70, '謝彗萍', '企劃專員', 'H01', '台北市', '中山區建國北路1段88巷12號', '02-5062442', 104, 34500, 7),
(71, '黃憲政', '企劃專員', 'H01', '台北縣', '土城市大暖路71號', '02-2683969', 236, 34500, 7),
(72, '鄭黛明', '企劃助理', 'H01', '台北縣', '淡水鎮埤島里51-11號', '02-6222131', 251, 35500, 14),
(73, '魏阿輝', '美工專員', 'H01', '台南市', '安南區安和路二段269號', '06-2552171', 709, 30000, 7),
(74, '鄭元杰', '美工專員', 'H01', '台南縣', '麻豆鎮小埤里苓子林8-12號', '06-5703271', 721, 31000, 14),
(75, '謝忠証', '美工助理', 'H01', '高雄市', '左營區新庄子路339巷3號', '07-3431236', 813, 29000, 7),
(76, '王禾', '企劃副理', 'H01', '高雄縣', '橋頭鄉芋林路299號', '07-6116622', 825, 59000, 14),
(77, '程光民', '企劃經理', 'H01', '雲林縣', '斗六市雲林路三段369號', '05-5222331', 640, 25600, 7),
(78, '楊習仁', '人事經理', 'I01', '台中縣', '烏日鄉中山路一段和平巷150弄27號', '04-3372621', 414, 28900, 7),
(79, '陳舜庭', '人事專員', 'I01', '台北市', '中山北路三段22號', '02-5925252#3408', 104, 51000, 7),
(80, '陳建岳', '人事專員', 'I01', '台南市', '中區中山路90號4樓', '06-2260191', 700, 23000, 7),
(81, '劉伯村', '人事專員', 'I01', '高雄市', '小港區長春路5號', '07-8023601', 812, 27500, 7),
(82, '張財全', '人事助理', 'I01', '高雄市', '前鎮區高雄加工出口區南一路10號', '07-8111171', 806, 31000, 7),
(83, '陳淑慧', '行政助理', 'J01', '台北市', '大安區仁愛路四段109號15樓', '02-7110990', 106, 23000, 7),
(84, '許進發', '行政經理', 'J01', '台北市', '敦化北路201-24號8樓', '02-7177888', 105, 21000, 14),
(85, '王芳香', '行政專員', 'J01', '新竹市', '科學工業園區工業東二路6號', '035-773121', 300, 28000, 7),
(86, '施美芳', '行政專員', 'J01', '嘉義縣', '水上鄉回歸村北回60號', '05-2357861', 608, 69900, 7),
(87, '劉大慶', '總機', 'J01', '彰化縣', '和美鎮彰新路二段290號', '04-7351127', 508, 30000, 14),
(88, '沈榮治', '會計助理', 'K01', '台北市', '莒光路310號5樓', '02-3062131', 108, 41200, 14),
(89, '王繡瑩', '會計助理', 'K01', '台北市', '復興北路181號6樓', '02-7129111', 105, 40000, 7),
(90, '林俐君', '會計師', 'K01', '台北市', '敦化北路201-24號後棟6樓', '02-7174500', 105, 27200, 7),
(91, '李德竹', '會計師', 'K01', '台南縣', '歸仁鄉南保村中山路734號', '06-2301171', 711, 65000, 7),
(92, '胡富傑', '會計經理', 'K01', '桃園縣', '觀音鄉富源村35-2號', '03-4901511', 328, 34500, 7),
(93, '唐德義', '資深會計師', 'K01', '高雄市', '林森三路193巷34號', '07-3336571', 806, 31500, 14),
(94, '鍾海萍', '資深會計師', 'K01', '新竹市', '科學工業園區展業一路20號2樓', '035-770255', 300, 25000, 7),
(95, '溫智傑', '圖書助理', 'L01', '台北市', '中山區南京東路一段92號8樓', '02-5316125', 104, 21000, 7),
(96, '邱資堡', '圖書助理', 'L01', '台北市', '塔城街66號3樓', '02-5523075', 103, 28100, 7),
(97, '洪惠芬', '圖書館專員', 'L01', '高雄縣', '大社工業區興工路1-3號', '07-3514151', 815, 11000, 14);

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `id` int(10) UNSIGNED NOT NULL,
  `產品名稱` varchar(30) DEFAULT NULL,
  `產品代號` varchar(10) DEFAULT NULL,
  `單價` int(5) DEFAULT NULL,
  `成本` int(5) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`id`, `產品名稱`, `產品代號`, `單價`, `成本`) VALUES
(1, '486主機板VL slot *3 16MB RAM', 'MB486V3R16', 13500, 8100),
(2, '486主機板VL slot *3 32MB RAM', 'MB486V3R32', 24600, 14500),
(3, '486主機板PCI slot *3 16MB RAM', 'MB486P3R16', 15200, 8400),
(4, '486主機板PCI slot *3 32MB RAM', 'MB486P3R32', 26000, 16700),
(5, '585主機板PCI slot *3 32MB RAM', 'MB586P3R32', 32000, 19200),
(6, '586主機板PCI slot *3 16MB RAM', 'MB586P3R16', 15500, 9200),
(7, '586主機板VL slot *3 32MB RAM', 'MB586V3R32', 36500, 22000),
(8, '586主機板VL slot *3 16MB RAM', 'MB586V3R16', 15200, 8780),
(9, '586主機板EISA slot *3 32MB RAM', 'MB586E3R32', 41200, 24300),
(10, '586主機板EISA slot *3 16MB RAM', 'MB586E3R16', 18800, 9900),
(11, '586主機板EISA slot *7 32MB RAM', 'MB586E7R32', 42300, 24950),
(12, '586主機板EISA slot *7 16MB RAM', 'MB586E7R16', 21500, 12000),
(13, 'SuperVGA 1280*1024 VL BUS 1MB', 'SVGAV1M', 3850, 2400),
(14, 'SuperVGA 1280*1024 VL BUS 2MB', 'SVGAV2M', 4680, 2850),
(15, 'SuperVGA 1280*1024 PCI BUS 1MB', 'SVGAP1M', 4120, 2450),
(16, 'SuperVGA 1280*1024 PCI BUS 2MB', 'SVGAP2M', 4950, 2900),
(17, 'SCSIcard PCI BUS', 'SCSIPB', 2200, 1300),
(18, 'SCSIcard VL BUS', 'SCSIVB', 1950, 1240),
(19, 'EnhanceIDE PCI BUS', 'EIDE1RP', 2200, 1250),
(20, 'EnhanceIDE VL BUS', 'EIDE2RP', 1560, 990);

-- --------------------------------------------------------

--
-- 資料表結構 `sales2`
--

CREATE TABLE `sales2` (
  `id` int(10) UNSIGNED NOT NULL,
  `客戶代號` varchar(5) DEFAULT NULL,
  `業務姓名` varchar(3) DEFAULT NULL,
  `產品代號` varchar(10) DEFAULT NULL,
  `數量` int(4) DEFAULT NULL,
  `交易年` int(2) DEFAULT NULL,
  `交易月` int(2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `sales2`
--

INSERT INTO `sales2` (`id`, `客戶代號`, `業務姓名`, `產品代號`, `數量`, `交易年`, `交易月`) VALUES
(1, 'A0001', '王玉治', 'MB486V3R16', 330, 89, 1),
(2, 'A0014', '林鵬翔', 'SVGAV1M', 900, 89, 1),
(3, 'A0015', '李進祿', 'SVGAV2M', 1600, 89, 1),
(4, 'A0016', '吳國信', 'SVGAP1M', 1100, 89, 1),
(5, 'A0020', '向大鵬', 'EIDE1RP', 980, 89, 2),
(6, 'A0017', '林玉堂', 'SVGAP2M', 280, 89, 3),
(7, 'A0019', '陳曉蘭', 'SCSIVB', 440, 89, 3),
(8, 'A0026', '謝穎青', 'MB586E7R16', 1000, 89, 3),
(9, 'A0027', '陳雅賢', 'SVGAV1M', 120, 89, 3),
(10, 'A0028', '郭曜明', 'SVGAV2M', 1950, 89, 3),
(11, 'A0029', '張志輝', 'SVGAP1M', 190, 89, 3),
(12, 'A0030', '林玉堂', 'SVGAP2M', 2400, 89, 3),
(13, 'A0031', '李進祿', 'SCSIPB', 200, 89, 3),
(14, 'A0034', '林鳳春', 'EIDE2RP', 950, 89, 4),
(15, 'A0035', '陳曉蘭', 'MB586P3R16', 1100, 89, 4),
(16, 'A0036', '林鳳春', 'MB586V3R32', 580, 89, 4),
(17, 'A0038', '莊國雄', 'MB586E3R32', 1000, 89, 4),
(18, 'A0039', '陳雅賢', 'MB586E3R16', 950, 89, 4),
(19, 'A0041', '陳雅賢', 'MB586E7R16', 180, 89, 4),
(20, 'A0002', '吳美成', 'SVGAV1M', 700, 89, 5),
(21, 'A0003', '莊國雄', 'SVGAV2M', 950, 89, 5),
(22, 'A0019', '陳曉蘭', 'SVGAV1M', 600, 89, 5),
(23, 'A0043', '朱金倉', 'SVGAV2M', 200, 89, 5),
(24, 'A0046', '莊國雄', 'SCSIPB', 1600, 89, 5),
(25, 'A0047', '向大鵬', 'SCSIVB', 500, 89, 5),
(26, 'A0048', '陳曉蘭', 'EIDE1RP', 900, 89, 5),
(27, 'A0049', '吳國信', 'EIDE2RP', 1200, 89, 5),
(28, 'A0050', '張志輝', 'MB586V3R16', 1600, 89, 5),
(29, 'A0051', '林鵬翔', 'MB586E3R32', 1900, 89, 5),
(30, 'A0052', '吳美成', 'MB586E3R16', 1800, 89, 5),
(31, 'A0053', '林鳳春', 'MB586E7R32', 280, 89, 5),
(32, 'A0004', '王玉治', 'SVGAP1M', 800, 89, 6),
(33, 'A0005', '莊國雄', 'SVGAP2M', 480, 89, 6),
(34, 'A0006', '毛渝南', 'SCSIPB', 150, 89, 6),
(35, 'A0007', '王玉治', 'SCSIVB', 1600, 89, 6),
(36, 'A0008', '林玉堂', 'EIDE1RP', 1400, 89, 6),
(37, 'A0009', '朱金倉', 'EIDE2RP', 1200, 89, 6),
(38, 'A0010', '謝穎青', 'MB486P3R16', 1500, 89, 6),
(39, 'A0011', '毛渝南', 'MB486P3R32', 100, 89, 6),
(40, 'A0012', '郭曜明', 'MB586P3R16', 1480, 89, 6),
(41, 'A0013', '李進祿', 'MB586V3R32', 1280, 89, 6),
(42, 'A0014', '林鵬翔', 'MB586V3R16', 1500, 89, 6),
(43, 'A0015', '李進祿', 'MB586E3R32', 1350, 89, 6),
(44, 'A0016', '吳國信', 'MB586E3R16', 1700, 89, 6),
(45, 'A0022', '吳國信', 'MB586V3R16', 380, 89, 6),
(46, 'A0020', '向大鵬', 'SVGAV2M', 1000, 89, 7),
(47, 'A0023', '張志輝', 'SCSIPB', 800, 89, 7),
(48, 'A0024', '吳國信', 'SCSIVB', 400, 89, 7),
(49, 'A0025', '朱金倉', 'EIDE1RP', 1460, 89, 7),
(50, 'A0027', '陳雅賢', 'MB486V3R16', 1720, 89, 7),
(51, 'A0031', '李進祿', 'MB586P3R16', 150, 89, 7),
(52, 'A0032', '林鵬翔', 'MB586V3R32', 2100, 89, 7),
(53, 'A0033', '毛渝南', 'MB586V3R16', 1800, 89, 7),
(54, 'A0017', '林玉堂', 'MB586E7R32', 1220, 89, 8),
(55, 'A0035', '陳曉蘭', 'MB586E3R16', 1200, 89, 8),
(56, 'A0036', '林鳳春', 'MB586E7R32', 160, 89, 8),
(57, 'A0037', '吳美成', 'MB586E7R16', 580, 89, 8),
(58, 'A0039', '陳雅賢', 'SVGAV2M', 240, 89, 8),
(59, 'A0040', '向大鵬', 'SVGAP1M', 220, 89, 8),
(60, 'A0042', '王玉治', 'SCSIPB', 260, 89, 8),
(61, 'A0044', '謝穎青', 'EIDE1RP', 1100, 89, 8),
(62, 'A0045', '吳美成', 'EIDE2RP', 1400, 89, 8),
(63, 'A0047', '向大鵬', 'MB586V3R32', 1200, 89, 8),
(64, 'A0008', '林玉堂', 'SVGAP1M', 900, 89, 9),
(65, 'A0021', '陳雅賢', 'SVGAP1M', 780, 89, 9),
(66, 'A0048', '陳曉蘭', 'MB486V3R16', 1580, 89, 9),
(67, 'A0049', '吳國信', 'MB486V3R32', 1450, 89, 9),
(68, 'A0050', '張志輝', 'MB486P3R16', 1100, 89, 9),
(69, 'A0051', '林鵬翔', 'MB486P3R32', 920, 89, 9),
(70, 'A0052', '吳美成', 'MB586P3R16', 1200, 89, 9),
(71, 'A0053', '林鳳春', 'MB586V3R32', 260, 89, 9),
(72, 'A0054', '林鳳春', 'MB586V3R16', 220, 89, 9),
(73, 'A0055', '郭曜明', 'MB586E3R32', 140, 89, 9),
(74, 'A0056', '毛渝南', 'MB586E3R16', 160, 89, 9),
(75, 'A0057', '張志輝', 'MB586E7R32', 260, 89, 9),
(76, 'A0058', '林玉堂', 'MB586E7R16', 1830, 89, 9),
(77, 'A0059', '向大鵬', 'SVGAV1M', 1270, 89, 9),
(78, 'A0060', '謝穎青', 'SVGAV2M', 1340, 89, 9),
(79, 'A0009', '朱金倉', 'SVGAP2M', 600, 89, 10),
(80, 'A0010', '謝穎青', 'SCSIPB', 1520, 89, 10),
(81, 'A0011', '毛渝南', 'SCSIVB', 1460, 89, 10),
(82, 'A0012', '郭曜明', 'EIDE1RP', 1400, 89, 10),
(83, 'A0013', '李進祿', 'EIDE2RP', 2150, 89, 10),
(84, 'A0014', '林鵬翔', 'EIDE1RP', 1150, 89, 10),
(85, 'A0018', '朱金倉', 'MB586E7R16', 1190, 89, 10),
(86, 'A0022', '吳國信', 'SVGAP2M', 350, 89, 10),
(87, 'A0023', '張志輝', 'SCSIPB', 600, 89, 10),
(88, 'A0024', '吳國信', 'SCSIVB', 580, 89, 10),
(89, 'A0025', '朱金倉', 'EIDE1RP', 640, 89, 10),
(90, 'A0026', '謝穎青', 'EIDE2RP', 300, 89, 10),
(91, 'A0021', '陳雅賢', 'SVGAP1M', 300, 89, 11),
(92, 'A0028', '郭曜明', 'MB486V3R32', 180, 89, 11),
(93, 'A0029', '張志輝', 'MB486P3R16', 520, 89, 11),
(94, 'A0030', '林玉堂', 'MB486P3R32', 360, 89, 11),
(95, 'A0032', '林鵬翔', 'MB586V3R32', 120, 89, 11),
(96, 'A0033', '毛渝南', 'MB586V3R16', 150, 89, 11),
(97, 'A0034', '林鳳春', 'MB586E3R32', 1250, 89, 11),
(98, 'A0037', '吳美成', 'MB486P3R16', 1500, 89, 11),
(99, 'A0038', '莊國雄', 'MB486P3R32', 1000, 89, 11),
(100, 'A0039', '陳雅賢', 'MB586P3R16', 980, 89, 11),
(101, 'A0018', '朱金倉', 'MB586E7R16', 350, 89, 12),
(102, 'A0040', '向大鵬', 'MB586V3R32', 820, 89, 12),
(103, 'A0041', '陳雅賢', 'MB586V3R16', 600, 89, 12),
(104, 'A0042', '王玉治', 'MB586E3R32', 580, 89, 12),
(105, 'A0043', '朱金倉', 'MB586E3R16', 400, 89, 12),
(106, 'A0044', '謝穎青', 'MB586E7R32', 580, 89, 12),
(107, 'A0045', '吳美成', 'MB586E7R16', 880, 89, 12),
(108, 'A0008', '林玉堂', 'MB586V3R32', 560, 90, 1),
(109, 'A0010', '謝穎青', 'MB586E3R32', 520, 90, 1),
(110, 'A0031', '李進祿', 'MB586P3R16', 220, 90, 1),
(111, 'A0046', '莊國雄', 'SVGAV1M', 1200, 90, 1),
(112, 'A0048', '陳曉蘭', 'SVGAP1M', 1100, 90, 1),
(113, 'A0049', '吳國信', 'SVGAP2M', 1250, 90, 1),
(114, 'A0050', '張志輝', 'SCSIPB', 1200, 90, 1),
(115, 'A0051', '林鵬翔', 'SCSIVB', 1000, 90, 1),
(116, 'A0058', '林玉堂', 'MB586P3R16', 300, 90, 1),
(117, 'A0028', '郭曜明', 'MB486V3R32', 580, 90, 2),
(118, 'A0053', '林鳳春', 'EIDE2RP', 2300, 90, 2),
(119, 'A0054', '林鳳春', 'MB486V3R16', 1150, 90, 2),
(120, 'A0055', '郭曜明', 'MB486V3R32', 260, 90, 2),
(121, 'A0058', '林玉堂', 'MB586E7R16', 1050, 90, 2),
(122, 'A0002', '吳美成', 'MB486V3R16', 250, 90, 3),
(123, 'A0003', '莊國雄', 'MB486V3R16', 180, 90, 3),
(124, 'A0004', '王玉治', 'MB486V3R32', 600, 90, 3),
(125, 'A0018', '朱金倉', 'SCSIPB', 240, 90, 3),
(126, 'A0032', '林鵬翔', 'SCSIVB', 160, 90, 3),
(127, 'A0033', '毛渝南', 'EIDE1RP', 540, 90, 3),
(128, 'A0037', '吳美成', 'MB586E3R16', 220, 90, 3),
(129, 'A0042', '王玉治', 'SVGAP1M', 300, 90, 3),
(130, 'A0049', '吳國信', 'MB486V3R32', 520, 90, 3),
(131, 'A0056', '毛渝南', 'MB486P3R16', 240, 90, 3),
(132, 'A0060', '謝穎青', 'MB586V3R16', 700, 90, 3),
(133, 'A0005', '莊國雄', 'MB486P3R16', 620, 90, 4),
(134, 'A0019', '陳曉蘭', 'SVGAV1M', 840, 90, 4),
(135, 'A0037', '吳美成', 'MB586V3R16', 280, 90, 4),
(136, 'A0038', '莊國雄', 'MB586E7R32', 1100, 90, 4),
(137, 'A0039', '陳雅賢', 'MB586E7R16', 1250, 90, 4),
(138, 'A0040', '向大鵬', 'MB586E7R32', 1800, 90, 4),
(139, 'A0041', '陳雅賢', 'SVGAV2M', 180, 90, 4),
(140, 'A0042', '王玉治', 'SVGAV1M', 1600, 90, 4),
(141, 'A0043', '朱金倉', 'SVGAP2M', 1000, 90, 4),
(142, 'A0044', '謝穎青', 'SCSIPB', 950, 90, 4),
(143, 'A0045', '吳美成', 'SCSIVB', 600, 90, 4),
(144, 'A0059', '向大鵬', 'SVGAV1M', 840, 90, 4),
(145, 'A0001', '王玉治', 'MB586E7R16', 1500, 90, 5),
(146, 'A0006', '毛渝南', 'MB486P3R32', 900, 90, 5),
(147, 'A0007', '王玉治', 'MB586P3R16', 3200, 90, 5),
(148, 'A0021', '陳雅賢', 'EIDE2RP', 600, 90, 5),
(149, 'A0030', '林玉堂', 'MB486P3R32', 240, 90, 5),
(150, 'A0044', '謝穎青', 'SVGAP1M', 1500, 90, 5),
(151, 'A0045', '吳美成', 'SVGAP2M', 1800, 90, 5),
(152, 'A0046', '莊國雄', 'EIDE1RP', 300, 90, 5),
(153, 'A0047', '向大鵬', 'EIDE2RP', 700, 90, 5),
(154, 'A0050', '張志輝', 'MB486P3R16', 620, 90, 5),
(155, 'A0052', '吳美成', 'MB586P3R16', 580, 90, 5),
(156, 'A0054', '林鳳春', 'MB586V3R16', 260, 90, 5),
(157, 'A0055', '郭曜明', 'MB586E3R32', 520, 90, 5),
(158, 'A0006', '毛渝南', 'MB486V3R16', 480, 90, 6),
(159, 'A0007', '王玉治', 'MB486V3R32', 200, 90, 6),
(160, 'A0008', '林玉堂', 'MB486P3R16', 600, 90, 6),
(161, 'A0009', '朱金倉', 'MB486P3R32', 650, 90, 6),
(162, 'A0010', '謝穎青', 'MB586P3R16', 270, 90, 6),
(163, 'A0011', '毛渝南', 'MB586V3R32', 300, 90, 6),
(164, 'A0012', '郭曜明', 'MB586V3R16', 360, 90, 6),
(165, 'A0013', '李進祿', 'MB586E3R32', 1100, 90, 6),
(166, 'A0014', '林鵬翔', 'MB586E3R16', 1200, 90, 6),
(167, 'A0020', '向大鵬', 'SVGAV2M', 220, 90, 6),
(168, 'A0023', '張志輝', 'MB586E3R32', 1900, 90, 6),
(169, 'A0036', '林鳳春', 'MB586E3R32', 600, 90, 6),
(170, 'A0047', '向大鵬', 'SVGAV2M', 1100, 90, 6),
(171, 'A0057', '張志輝', 'MB586E7R32', 1200, 90, 6),
(172, 'A0059', '向大鵬', 'MB586V3R32', 600, 90, 6),
(173, 'A0016', '吳國信', 'MB586E3R16', 1600, 90, 7),
(174, 'A0026', '謝穎青', 'EIDE2RP', 1400, 90, 7),
(175, 'A0056', '毛渝南', 'MB586E3R16', 220, 90, 7),
(176, 'A0009', '朱金倉', 'MB586V3R16', 700, 90, 8),
(177, 'A0024', '吳國信', 'MB586E3R16', 150, 90, 8),
(178, 'A0029', '張志輝', 'MB486P3R16', 280, 90, 8),
(179, 'A0034', '林鳳春', 'MB586E3R32', 1200, 90, 8),
(180, 'A0038', '莊國雄', 'SVGAV1M', 600, 90, 8),
(181, 'A0041', '陳雅賢', 'SVGAP2M', 1100, 90, 8),
(182, 'A0043', '朱金倉', 'SCSIVB', 1100, 90, 8),
(183, 'A0046', '莊國雄', 'MB586P3R16', 1700, 90, 8),
(184, 'A0051', '林鵬翔', 'MB486P3R32', 450, 90, 8),
(185, 'A0057', '張志輝', 'MB486P3R32', 300, 90, 8),
(186, 'A0025', '朱金倉', 'MB586E7R32', 1600, 90, 9),
(187, 'A0040', '向大鵬', 'SVGAV1M', 160, 90, 9),
(188, 'A0048', '陳曉蘭', 'MB486V3R16', 500, 90, 9),
(189, 'A0011', '毛渝南', 'MB586E3R16', 260, 90, 10),
(190, 'A0015', '李進祿', 'EIDE2RP', 1460, 90, 10),
(191, 'A0022', '吳國信', 'SVGAP2M', 700, 90, 10),
(192, 'A0012', '郭曜明', 'MB586E7R32', 660, 90, 11),
(193, 'A0017', '林玉堂', 'MB586E7R32', 1900, 90, 11),
(194, 'A0027', '陳雅賢', 'MB486V3R16', 260, 90, 11),
(195, 'A0035', '陳曉蘭', 'MB486V3R16', 1100, 90, 11),
(196, 'A0036', '林鳳春', 'MB486V3R32', 1600, 90, 11),
(197, 'A0053', '林鳳春', 'MB586V3R32', 300, 90, 11),
(198, 'A0013', '李進祿', 'MB586E7R16', 350, 90, 12),
(199, 'A0052', '吳美成', 'EIDE1RP', 1000, 90, 12),
(200, 'A0060', '謝穎青', 'SVGAV2M', 750, 90, 12);

-- --------------------------------------------------------

--
-- 資料表結構 `user`
--

CREATE TABLE `user` (
  `id` int(10) UNSIGNED NOT NULL,
  `acc` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `pw` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `pr` text COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `user`
--

INSERT INTO `user` (`id`, `acc`, `pw`, `name`, `pr`) VALUES
(1, 'admin', 'ad1234', 'admin', 'a:2:{i:0;i:1;i:1;i:2;}'),
(2, 'mack', 'ma1234', 'mack', 'a:2:{i:0;i:1;i:1;i:2;}');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `customer`
--
ALTER TABLE `customer`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `dept`
--
ALTER TABLE `dept`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `employee`
--
ALTER TABLE `employee`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `sales2`
--
ALTER TABLE `sales2`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動增長(AUTO_INCREMENT)
--

--
-- 使用資料表自動增長(AUTO_INCREMENT) `customer`
--
ALTER TABLE `customer`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `dept`
--
ALTER TABLE `dept`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `employee`
--
ALTER TABLE `employee`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=98;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `product`
--
ALTER TABLE `product`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `sales2`
--
ALTER TABLE `sales2`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=201;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `user`
--
ALTER TABLE `user`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
